-- Migration: insert_health_mock_data_rehab_plans
-- Created at: 1763373403

INSERT INTO rehabilitation_plans (user_id, plan_name, exercise_type, intensity_level, duration_minutes, frequency_per_week, start_date, completion_rate, instructions, precautions, status) VALUES
('7885af30-efd1-4904-b2a7-06feac81ee32', '关节活动训练', '有氧运动', 'moderate', 30, 7, '2025-11-17', 40.9, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('e9ee8027-1f4e-4ce3-987f-7b205a6a01d6', '太极拳', '有氧运动', 'moderate', 40, 5, '2025-11-17', 79.7, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('695ac55d-6b5a-4af6-94fb-d5421a34a588', '关节活动训练', '关节训练', 'moderate', 30, 5, '2025-11-17', 62.0, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('bd790ed9-fb4c-4f3d-b31b-9ac4ba354307', '关节活动训练', '柔韧训练', 'low', 30, 3, '2025-11-17', 55.8, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('b9cdb80b-9e8c-440e-aa99-f106a0447071', '快走训练', '柔韧训练', 'low', 40, 6, '2025-11-17', 38.5, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('462d8370-89c3-4704-aaea-4825cae9d70d', '太极拳', '有氧运动', 'moderate', 40, 4, '2025-11-17', 25.1, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('46796037-60d5-4a71-a2c6-d87f7df7c80f', '快走训练', '有氧运动', 'low', 40, 4, '2025-11-17', 72.2, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('474bbd6d-2da5-40c3-875b-d2d3f229e6d7', '太极拳', '关节训练', 'moderate', 30, 6, '2025-11-17', 34.9, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('fcbc3f1e-320d-4768-a4e1-9bc001b295af', '太极拳', '柔韧训练', 'low', 40, 5, '2025-11-17', 35.0, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('4b3d61b8-9a98-4c11-be4e-1a2269bf2cbb', '关节活动训练', '有氧运动', 'low', 40, 6, '2025-11-17', 76.1, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('e053f8bb-533e-4fa3-bcf2-b870a0fc2d02', '快走训练', '柔韧训练', 'low', 40, 6, '2025-11-17', 30.1, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('8b0ae564-ead6-475f-8001-4316b998758a', '太极拳', '柔韧训练', 'low', 40, 5, '2025-11-17', 53.6, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('245df5a6-0aef-44aa-b3c6-eebb9623f3c9', '太极拳', '有氧运动', 'moderate', 40, 3, '2025-11-17', 38.8, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('79a3e25e-a9cf-457b-8138-9de646167526', '快走训练', '有氧运动', 'low', 40, 7, '2025-11-17', 63.9, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('384dad0b-e910-486e-9ae8-f4b1c735bae7', '太极拳', '有氧运动', 'low', 20, 6, '2025-11-17', 66.2, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('58616f29-390f-480f-aaa7-d8b2c7bf0620', '快走训练', '柔韧训练', 'moderate', 30, 7, '2025-11-17', 52.8, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('4e749afa-21e7-4cc9-8020-42ce895fc557', '太极拳', '有氧运动', 'moderate', 20, 6, '2025-11-17', 78.1, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('429776d0-e2cf-40aa-9ac2-099c037828c1', '关节活动训练', '有氧运动', 'low', 30, 3, '2025-11-17', 62.0, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('4bce6166-6f8f-4016-9560-a0405350a5f9', '快走训练', '关节训练', 'low', 30, 7, '2025-11-17', 79.6, '循序渐进，量力而行', '避免过度疲劳', 'active'),
('89311b87-ddbc-4ef3-8622-143a6310da86', '快走训练', '柔韧训练', 'low', 30, 3, '2025-11-17', 81.9, '循序渐进，量力而行', '避免过度疲劳', 'active');;